docs/dijkstra.html
<!doctype html>
<html lang="en">
<head>
<title>Algoritmo di Dijkstra</title>
<!-- 2022-06-01 Wed 17:35 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Pietro Visconti">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Algoritmi preliminari</a></li>
<li><a href="#sec-2">2. Proprietà preliminari</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Proprietà del limite inferiore</a></li>
<li><a href="#sec-2-2">2.2. Proprietà dell&rsquo;assenza di cammino</a></li>
<li><a href="#sec-2-3">2.3. Proprietà della convergenza</a></li>
<li><a href="#sec-2-4">2.4. Proprietà del grafo dei predecessori</a></li>
<li><a href="#sec-2-5">2.5. Distanza triangolare</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Algoritmo</a></li>
<li><a href="#sec-4">4. Complessità</a>
<ul class="nav">
<li><a href="#sec-4-1">4.1. Implementazione con Q array lineare</a></li>
<li><a href="#sec-4-2">4.2. Implementazione con Q heap binario</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Dimostrazione della correttezza</a></li>
<li><a href="#sec-6">6. Cammino minimo tra tutte le coppie di nodi</a></li>
<li><a href="#sec-7">7. Confronto tra gli algoritmi</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Algoritmo di Dijkstra</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Algoritmi preliminari</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #a89984;">/*</span>
<span style="color: #a89984;">G = grafo</span>
<span style="color: #a89984;">s = nodo sorgente</span>
<span style="color: #a89984;">*/</span>
<span style="color: #b57614;">INIT_SS</span><span style="color: #076678;">(</span>G, s<span style="color: #076678;">){</span>
    <span style="color: #9d0006;">for</span> each u in V<span style="color: #b16286;">[</span>G<span style="color: #b16286;">]{</span>
        d<span style="color: #8ec07c;">[</span>u<span style="color: #8ec07c;">]</span> = +inf
        &#960;<span style="color: #8ec07c;">[</span>u<span style="color: #8ec07c;">]</span> = <span style="color: #8f3f71;">NIL</span>
    <span style="color: #b16286;">}</span>
    d<span style="color: #b16286;">[</span>s<span style="color: #b16286;">]</span> = <span style="color: #8f3f71; font-weight: bold;">0</span>
<span style="color: #076678;">}</span>

<span style="color: #a89984;">/*</span>
<span style="color: #a89984;">v = nodo di arrivo</span>
<span style="color: #a89984;">u = nodo precedente a v (?)</span>
<span style="color: #a89984;">w(u, v) = peso dell'arco tra u e v</span>
<span style="color: #a89984;">*/</span>
<span style="color: #b57614;">RELAX</span><span style="color: #076678;">(</span>u, v, w<span style="color: #b16286;">(</span>u, v<span style="color: #b16286;">)</span><span style="color: #076678;">){</span>
    <span style="color: #9d0006;">if</span><span style="color: #b16286;">(</span>d<span style="color: #8ec07c;">[</span>v<span style="color: #8ec07c;">]</span> &gt; d<span style="color: #8ec07c;">[</span>u<span style="color: #8ec07c;">]</span> + w<span style="color: #8ec07c;">(</span>u, v<span style="color: #8ec07c;">)</span><span style="color: #b16286;">){</span>
        d<span style="color: #8ec07c;">[</span>v<span style="color: #8ec07c;">]</span> = d<span style="color: #8ec07c;">[</span>u<span style="color: #8ec07c;">]</span> + w<span style="color: #8ec07c;">(</span>u, v<span style="color: #8ec07c;">)</span>
        &#960;<span style="color: #8ec07c;">[</span>v<span style="color: #8ec07c;">]</span> = u
    <span style="color: #b16286;">}</span>
<span style="color: #076678;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Proprietà preliminari</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Proprietà del limite inferiore</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Se si inizializza con INIT<sub>SS</sub>, per qualunque sequenza di RELAX si ha:
</p>
<blockquote>
<p>
δ(s, u) &lt;= d[u] &#x2014; ∀ u ∈ V
</p>
</blockquote>

<p>
Inoltre, se dopo una RELAX
</p>

<blockquote>
<p>
δ(s, u) = d[u]
</p>
</blockquote>

<p>
allora il valore di d[u] non potrà cambiare mai più
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Proprietà dell&rsquo;assenza di cammino</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Se non esiste un cammino tra s e u
</p>
<blockquote>
<p>
δ(s, u) = +inf
</p>
</blockquote>

<p>
e allora dopo la INIT<sub>SS</sub> si ha
</p>

<blockquote>
<p>
d[u] = δ(s, u)
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Proprietà della convergenza</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Se d[u] =  δ(s, u):
</p>
<blockquote>
<p>
La prima RELAX su (u, v) porrà d[v] =  δ(s, v)
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Proprietà del grafo dei predecessori</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Se alla fine di un algoritmo che usa RELAX si ha:
</p>
<blockquote>
<p>
d[u] = δ(s, u)
</p>
</blockquote>

<p>
Allora Gπ è un albero di cammini minimi
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Distanza triangolare</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Dato (u, v) ∈ E
</p>
<blockquote>
<p>
δ(s, v) = δ(s, u) + w(u, v)
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Algoritmo</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #a89984;">/*</span>
<span style="color: #a89984;">G = grafo</span>
<span style="color: #a89984;">w = funzione peso</span>
<span style="color: #a89984;">s = nodo sorgente</span>

<span style="color: #a89984;">PREREQUISITI: i pesi devono essere positivi e non possono esserci cicli negativi.</span>
<span style="color: #a89984;">*/</span>
<span style="color: #b57614;">DIJKSTRA</span><span style="color: #076678;">(</span>G, w, s<span style="color: #076678;">){</span>
    <span style="color: #8f3f71;">INIT_SS</span><span style="color: #b16286;">(</span>G, s<span style="color: #b16286;">)</span>
    Q &lt;- V<span style="color: #b16286;">[</span>G<span style="color: #b16286;">]</span>
    S &lt;- <span style="color: #8f3f71;">NIL</span>

    <span style="color: #9d0006;">while</span><span style="color: #b16286;">(</span>Q != <span style="color: #8f3f71;">NIL</span><span style="color: #b16286;">){</span>
        u &lt;- <span style="color: #8f3f71;">EXTRACT_MIN</span><span style="color: #8ec07c;">(</span>Q<span style="color: #8ec07c;">)</span>
        S &lt;- S U <span style="color: #8ec07c;">{</span>u<span style="color: #8ec07c;">}</span>

        <span style="color: #9d0006;">for</span> each V in <span style="color: #8f3f71;">ADJ</span><span style="color: #8ec07c;">[</span>u<span style="color: #8ec07c;">]</span>
            <span style="color: #8f3f71;">RELAX</span><span style="color: #8ec07c;">(</span>u, v, w<span style="color: #d65d0e;">(</span>u, v<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
    <span style="color: #b16286;">}</span>

    <span style="color: #9d0006;">return</span> <span style="color: #b16286;">(</span>d, G&#960;<span style="color: #b16286;">)</span>
<span style="color: #076678;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Complessità</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Implementazione con Q array lineare</h3>
<div class="outline-text-3" id="text-4-1">
<blockquote>
<p>
n (inizializzazione) + n<sup>2</sup> (extract<sub>min</sub>) + m (relax, m = out-degree)
</p>

<p>
= O(n + n<sup>2</sup> + m) -&gt; <font color="red"> O(n^2)</font>
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Implementazione con Q heap binario</h3>
<div class="outline-text-3" id="text-4-2">
<blockquote>
<p>
n (inizializzazione) + nlogn (extract<sub>min</sub>) + mlogn (relax + ribilanciamento dell&rsquo;albero)
</p>

<p>
= O(n + nlogn + mlogn) -&gt; <font color="red"> O(mlogn)</font>
</p>
</blockquote>
<p>
(In base a cosa m &gt; n ??)
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Dimostrazione della correttezza</h2>
<div class="outline-text-2" id="text-5">
<blockquote>
<p>
Sia G = (V, E), w: E -&gt; R, w(u, v) &gt;= 0,
s è il nodo sorgente.
<br>
Alla fine dell&rsquo;algoritmo di Dijkstra si avra:
</p>
<ol class="org-ol">
<li><b>d[u] = δ(s, u)</b>
</li>
<li>Gπ è un <b>albero di cammini minimi</b>
</li>
</ol>

<p>
<font color="red"> Dimostrazione</font>:
∀ u ∈ V, d[u] = δ(s, u) dopo aver estratto il nodo u.
<br>
<b>PER ASSURDO</b>: Esiste u ∈ V tale che d[u] != δ(s, u) e u sia il primo vertice per cui questo accade.
<br>
</p>
<ol class="org-ol">
<li>u != s -&gt; d[s] = δ(s, s)
</li>
<li>Al momento dell&rsquo;estrazione di u, S != NIL (s ∈ S)
</li>
<li>Esiste un cammino minimo tra s e u, in cui almeno un arco (x, y) attraversa il taglio (S, V \ S)
</li>
<li>δ(s, u) = +inf = d[u] (fine)
</li>
<li>Esiste cammino minimo tra s e u
</li>
<li>d[x] = δ(s, x) per ipotesi
</li>
<li>d[y] = δ(s, y) per proprietà dela convergenza
</li>
<li>d[u] &lt;= d[y] per Dijkstra
</li>
<li>δ(s, y) &lt; δ(s, u) perche i pesi degli archi sono sempre maggiori di 0
</li>
<li>δ(s, u) &lt;= d[u] per proprietà del limite inferiore
</li>
</ol>

<p>
<b>DI CONSEGUENZA</b>:
<br>
</p>
<ul class="org-ul">
<li>δ(s, u) &lt;= d[u]
</li>
<li>&lt;= d[y]
</li>
<li>= δ(s, y)
</li>
<li>&lt;= δ(s, u)
</li>
</ul>


<p>
<font color="red"> d[u] = δ(s u) è ASSURDO</font>
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Cammino minimo tra tutte le coppie di nodi</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #b57614;">ITERATED_DIJKSTRA</span><span style="color: #076678;">(</span>G, w<span style="color: #076678;">){</span>
    <span style="color: #9d0006;">for</span> each u in V<span style="color: #b16286;">[</span>G<span style="color: #b16286;">]</span>
        <span style="color: #8f3f71;">DIJKSTRA</span><span style="color: #b16286;">(</span>G, w, u<span style="color: #b16286;">)</span>
<span style="color: #076678;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Confronto tra gli algoritmi</h2>
<div class="outline-text-2" id="text-7">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">algorithm</th>
<th scope="col" class="text-left">SPARSO</th>
<th scope="col" class="text-left">DENSO</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">IT<sub>DIJKSTRA</sub> array</td>
<td class="text-left">O(n<sup>3</sup>)</td>
<td class="text-left">O(n<sup>3</sup>)</td>
</tr>

<tr>
<td class="text-left">IT<sub>DIJKSTRA</sub> heap</td>
<td class="text-left">O(n<sup>2</sup> * logn)</td>
<td class="text-left">O(n<sup>3</sup> * logn)</td>
</tr>

<tr>
<td class="text-left">IT<sub>BF</sub></td>
<td class="text-left">O(n<sup>3</sup>)</td>
<td class="text-left">O(n<sup>4</sup>)</td>
</tr>
</tbody>
</table>

<p>
<a href="../index.html">HOME</a>
</p>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Pietro Visconti</p>
<p class="date">Created: 2022-06-01 Wed 17:35</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
